OdDAI.SignatureSection.getContent
\details
Retrieves the value of the signature content.
\returns returns an OdAnsiString that contains content value

OdDAI.SignatureSection.setContent(OdAnsiString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets new value for the signature content of a signature section instance.
\param content [in] content value.

OdDAI.SignatureSection.getPosition
\details
Retrieves the value of the starting postion.
\returns returns an integer that contains position value

OdDAI.SignatureSection.setPosition(System.UInt64)
\details
Sets new value for the starting position of a signature section instance.
\param position [in] position value.

OdDAI.SignatureSection.#ctor(System.UInt64,OdAnsiString)
\details
Creates a new signature section object with default or set parameters.
\remarks
Signature section presence notifies writing filer to calculate digital signature and write it at the end of the file during model writing process.

OdDAI.SignatureSection
\details
The class that implements storing and handling of a digital signature for the file part before SIGNATURE tag of the section.